tinyurl/e2e/taurus.yml
---
settings:
  env:
    BASE_URL: 192.168.99.100

execution:
  - concurrency: 5
    hold-for: 5m
    # ramp-up: 40s
    scenario: resolve-test
scenarios:
  resolve-test:
    requests:
      - label: resolve
        method: GET
        url: http://${BASE_URL}/v1/url/${hash}
    data-sources:
      - path: e2e/hashes.csv   # this is a full form
        delimiter: ';'
        quoted: false
        encoding: "utf-8"
        loop: true
        variable-names: hash
        random-order: true
  shorten-once:
    requests:
      - url: http://${BASE_URL}/v1/url
        headers:
          Content-Type: application/json
        method: POST
        body:
          originalUrl: http://my-url/${__jm__Loop Controller__idx}
  shorten-test:
    requests:
      - label: shorten
        loop: forever
        do:
          - include-scenario: shorten-once


modules:
  jmeter:
    gui: true